<?php

// Arabic translation
return [
    'modelLabel' => 'تخصص',
    'navigation-label' => 'التخصصات',
    'plural-label' => 'التخصصات',
    'please-add-translation' => 'يرجى إضافة ترجمة الاسم والوصف لكل تخصص مضاف في الملف المقابل',
    'unique-speciality' => 'تمت إضافة التخصص بالفعل',
    'attention' => 'حذاري',

    'form-validation-speciality-name-unique' => 'لقد أضفت هذا التخصص بالفعل',
    'description' => 'وصف',
    'table-emptyStateHeading' => '',
    'table-emptyStateDescription' => 'أضف تخصصاتك',

    'Allergology' => [
        'name' => 'الحساسية',
        'description' => 'التخصص المخصص لتشخيص وعلاج الحساسية.',
    ],
    'Anesthesiology' => [
        'name' => 'التخدير',
        'description' => 'فرع من الطب يختص بالتخدير وإنعاش المرضى.',
    ],
    'Cardiology' => [
        'name' => 'أمراض القلب',
        'description' => 'التخصص الطبي الذي يتناول أمراض القلب والجهاز الدوري.',
    ],
    'Dermatology' => [
        'name' => 'الأمراض الجلدية',
        'description' => 'التخصص الطبي المركز على أمراض الجلد والأغشية المخاطية والمناطق الظاهرة.',
    ],
    'Endocrinology' => [
        'name' => 'الغدد الصماء',
        'description' => 'فرع من الطب يدرس الهرمونات والاضطرابات الغدية.',
    ],
    'Gastroenterology' => [
        'name' => 'أمراض الجهاز الهضمي',
        'description' => 'التخصص الطبي المتعلق بالجهاز الهضمي وأمراضه.',
    ],
    'Geriatrics' => [
        'name' => 'الشيخوخة',
        'description' => 'المجال الطبي المركز على صحة كبار السن.',
    ],
    'Gynecology' => [
        'name' => 'أمراض النساء',
        'description' => 'التخصص المخصص لصحة الإنجاب وأمراض الجهاز التناسلي الأنثوي.',
    ],
    'Hematology' => [
        'name' => 'أمراض الدم',
        'description' => 'فرع من الطب يتناول أمراض الدم.',
    ],
    'Hepatology' => [
        'name' => 'أمراض الكبد',
        'description' => 'التخصص الطبي المركز على دراسة الكبد والقنوات الصفراوية والطحال.',
    ],
    'Immunology' => [
        'name' => 'المناعة',
        'description' => 'التخصص الطبي الذي يتناول أمراض الجهاز المناعي.',
    ],
    'Emergency medicine' => [
        'name' => 'الطب الطارئ',
        'description' => 'التخصص الطبي الذي يتناول المرضى الذين يحتاجون إلى رعاية فورية.',
    ],
    'General medicine' => [
        'name' => 'الطب العام',
        'description' => 'فرع من الطب يقدم خدمات صحية أولية ومستمرة.',
    ],
    'Internal Medicine' => [
        'name' => 'الطب الباطني',
        'description' => 'التخصص الطبي المخصص لتشخيص والتعامل الشامل مع الأمراض.',
    ],
    'Neonatology' => [
        'name' => 'حديثي الولادة',
        'description' => 'التخصص الفرعي من طب الأطفال الذي يتناول الأطفال حديثي الولادة.',
    ],
    'Nephrology' => [
        'name' => 'أمراض الكلى',
        'description' => 'التخصص الطبي الذي يتناول الكلى والأمراض الكلوية.',
    ],
    'Neurology' => [
        'name' => 'أمراض الأعصاب',
        'description' => 'التخصص الطبي الذي يتناول أمراض الجهاز العصبي.',
    ],
    'Oncology' => [
        'name' => 'علم الأورام',
        'description' => 'فرع من الطب يركز على تشخيص وعلاج السرطان.',
    ],
    'Pediatrics' => [
        'name' => 'طب الأطفال',
        'description' => 'التخصص الطبي المخصص لصحة وأمراض الأطفال.',
    ],
    'Pneumology' => [
        'name' => 'أمراض الرئة',
        'description' => 'التخصص الطبي الذي يتناول أمراض الرئتين والجهاز التنفسي.',
    ],
    'Psychiatry' => [
        'name' => 'الطب النفسي',
        'description' => 'فرع من الطب يختص بدراسة وتشخيص وعلاج ووقاية الأمراض العقلية.',
    ],

];
