<?php

return [
    // Arabic translations
    'modelLabel' => 'ساعات العمل',
    'section-description' => "يمكنك إضافة عدة فترات غير متصلة لكل يوم.\nمثال: الإثنين(8:00-12:00 ثم 14:00-17:00)",
    'day' => 'اليوم',
    'start_at' => 'البداية',
    'end_at' => 'النهاية',
    'table-emptyStateHeading' => 'لم يتم العثور على ساعات عمل.',
    'table-emptyStateDescription' => 'أضف ساعات عملك حتى يتمكن المرضى من جدولة المواعيد وفقًا لساعات عملك، يمكنك إضافة عدة ساعات غير متصلة لكل يوم.',
    'end-at-before' => 'يجب أن يكون وقت البداية تاريخًا يسبق وقت النهاية.',
    'start-at-after' => 'يجب أن يكون وقت النهاية تاريخًا يلي وقت البداية.',

    'hour' => 'ساعة',
    'timetable' => 'جدولي',
    'overlap_error' => 'ساعات العمل لهذا اليوم والفاصل الزمني موجودان بالفعل.',

];
